nsumption in one cycle for a given number of cycles in the given range of cycles in the first execution of the target instruction, to find out the power consumption of the microprocessor for the given number of cycles; and</claim-text><claim-text>using the power consumption for the given number of cycles in the first execution of the target instruction and the power consumption in one cycle in the second execution of the target instruction, to estimate the cache-hit power consumption of the microprocessor reading the target instruction out of the instruction cache and executing the same, as well as the cache-missed power consumption of the microprocessor of reading the target instruction out of the main memory and executing the same, wherein<claim-text>the target instruction is executed in transistor-level or gate-level simulations.</claim-text></claim-text></claim-text></claim>"}, {"num": 4, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"4\"><claim-text>4. A system for estimating the power consumption of a microprocessor on each instruction the microprocessor reads out of one of a main memory and an instruction cache and executes through pipelined processing stages, comprising:<claim-text>means for entering a string of machine language instructions that include consecutive target instructions and a jump instruction to jump to the first one of the target instructions, the number of the target instructions being at least twice as large as the number of instructions simultaneously read out of the main memory;</claim-text><claim-text>means for carrying out transistor-level or gate-level simulations to simulate the microprocessor reading the machine language instructions out of one of the main memory and instruction cache and executing the machine language instructions;</claim-text><claim-text>means for estimating the power consumption of the microprocessor on a cache-missed instruction according to a result of the first execution of the consecutive target instructions; and</claim-text><claim-text>means for estimating the power consumption of the microprocessor on a cache-hit instruction according to a result of the second execution of the consecutive target instructions.</claim-text></claim-text></claim>"}, {"num": 5, "parent": 4, "type": "dependent", "paragraph_markup": "<claim num=\"5\"><claim-text>5. The system according to claim 4, wherein the means for estimating the power consumption of the microprocessor on a cache-hit instruction estimates the power consumption (Ph) on a cache-hit instruction by obtaining the power consumption thereof in a given cycle in the second execution of the consecutive target instructions, and<claim-text>wherein the means for estimating the power consumption of the microprocessor on a cache-missed instruction estimates the power consumption (Pm) of the microprocessor on a cache-missed instruction as follows:<claim-text><pre listing-type=\"equation\" xml:space=\"preserve\"><!--Greenbook equation-->Pm={the sum of power consumption for \"I+N\" cycles starting from the \"P+N\"th cycle in the first execution of the consecutive target instructions}-{(I-1)×Ph}</pre></claim-text><claim-text>Where P is the number of pipelined processor stages, I is the number of instructions to be simultaneously transferred from the main memory to the instruction cache when a cache miss occurs, and N is the total number of stalls that occur when executing the I instructions simultaneously transferred to and stored in the instruction cache.</claim-text></claim-text></claim-text></claim>"}, {"num": 6, "parent": -1, "type": "independent", "paragraph_markup": "<claim num=\"6\"><claim-text>6. A system for estimating the power consumption of a microprocessor on each instruction the microprocessor reads out of one of a main memory and an instruction cache and executes, comprising:<claim-text>means for entering a string of machine language instructions that include at least one target instruction and a jump instruction to jump to the target instruction;</claim-text><claim-text>means for carrying out transistor-level or gate level simulations to simulate the microprocessor reading the machine language instructions out of one of the main memory and instruction cache and executing the machine language instructions;</claim-text><claim-text>means for estimating the power consumption of the microprocessor on the target instruction in a cache miss state according to a result of the first execution of the instructions; and</claim-text><claim-text>means for estimating the power consumption of the microprocessor on the target instruction in a cache hit state according to a result of the second execution of the instructions.</claim-text></claim-text></claim>"}]}], "descriptions": [{"lang": "EN", "paragraph_markup": "<description lang=\"EN\" load-source=\"patent-office\" mxw-id=\"PDES67323080\"><?BRFSUM description=\"Brief Summary\" end=\"lead\"?><h4>BACKGROUND OF THE INVENTION</h4><p>1. Field of the Invention</p><p>The present invention relates to a method of estimating the power consumption of a microprocessor on each instruction the microprocessor reads out of a main memory or an instruction cache and executes.</p><p>2. Description of the Prior Art</p><p>Computer technologies and semiconductor integrated circuits have made great progress recently, and accordingly, electronic equipment, in particular, personal computers have improved their compactness and portability. Under these circumstances, an important subject is to improve the processing speed of microprocessors as well as reducing the power consumption thereof. To achieve a reduction in power consumption, it is necessary to correctly evaluate the power consumption of a microprocessor when designing the same.</p><p>An example of a technique of evaluating the power consumption of a microprocessor is disclosed in \"Power Analysis of Embedded Software; A First Step towards Software Power Minimization\" of Vivek Tiwari, Sharad Malik, and Andrew Wolfe in IN IEEE-94, pp. 384-390 (1994). This is a method of evaluating the power consumption of a microprocessor including software.</p><p>This method pays attention to the kind of each instruction to be executed by a microprocessor and estimates the power consumption of the microprocessor. Namely, the method finds out the individual power consumption of different instructions to be executed by the microprocessor in advance, applies the found power consumption to each instruction that is still in an assembler program, and estimates total power to be consumed by the instructions when they are actually executed by the microprocessor.</p><p>This method executes a given instruction by the microprocessor and measures the power consumption thereof with a power meter connected to the microprocessor. If the microprocessor employs an instruction cache, it is necessary to separate cache-hit power consumption from cache-miss power consumption. These two kinds of power consumption are unable to be found out with the use of a single instruction file. Namely, it is necessary to prepare an instruction file 101 of FIG. 1 for measuring the cache-miss power consumption of each instruction, as well as an instruction file 102 of FIG. 2 for measuring the cache-hit power consumption of each instruction.</p><p>The instruction file 101 consists of a state setting section 103 for setting a microprocessor in a cache miss state, and a target instruction executing section 104 for executing target instructions for which power consumption is going to be estimated. The instruction file 102 consists of a state setting section 103 for setting a microprocessor in a cache hit state, and a target instruction executing section 104 for executing target instructions for which power consumption is going to be estimated. The state setting section 103 of FIG. 1 disables cached instructions and establishes a cache miss state, and the state setting section 103 of FIG. 2 executes, in advance, codes used by the instruction executing section 104 and establishes a cache hit state. As a result, the instruction files 101 and 102 are each long and intricate, and therefore, are difficult to prepare.</p><p>In this way, the prior art of finding out the power consumption of a microprocessor, which has an instruction cache, on each instruction involves long and intricate instruction files to set measuring environments for the microprocessor. Such instruction files are very difficult to make because they need time and labor to prepare.</p><h4>SUMMARY OF THE INVENTION</h4><p>In view of these problems, an object of the present invention is to provide a method of estimating the power consumption of a microprocessor on each instruction, employing an instruction file that is simple and easy to prepare.</p><p>In order to accomplish the object, an aspect of the present invention provides a method of estimating the power consumption of a microprocessor on each instruction the microprocessor reads out of a main memory or an instruction cache and executes through pipelined processing stages. The method includes a step of consecutively executing, at least two times, a group of target instructions whose number is at least twice as large as the number of instructions to be simultaneously transferred from the main memory to the instruction cache, a step of finding the power consumption of the microprocessor in each cycle in a given range of cycles in each of the first and second executions of the instruction group, a step of accumulating the power consumption in each cycle for a given number of cycles in a given range of cycles in the first execution of the instruction group, to find out the power consumption of the microprocessor for the given number of cycles, and a step of using the power consumption for the given number of cycles in the first execution of the instruction group and the power consumption in each cycle in the second execution of the instruction group, to estimate the power consumption of the microprocessor of reading a cache-hit instruction out of the instruction cache and executing the same, as well as the power consumption of the microprocessor of reading a cache-missed instruction out of the main memory and executing the same. The instructions are executed in transistor- or gate-level simulations.</p><p>According to another aspect of the present invention, the estimated power consumption (Ph) of the microprocessor on a cache-hit instruction is obtained as the power consumption thereof in a given cycle in the second execution of the instruction group. On the other hand, the estimated power consumption (Pm) of the microprocessor on a cache-missed instruction is obtained as follows:</p><p></p><pre listing-type=\"equation\" xml:space=\"preserve\"><!--Greenbook equation-->Pm={the sum of power consumption for \"I+N\" cycles starting from the \"P+N\"th cycle in the first execution of the instruction group}-{(I-1)×Ph}</pre><p>where P is the number of the pipelined processing stages, I is the number of instructions to be simultaneously transferred from the main memory to the instruction cache when a cache miss occurs, and N is the total number of stalls to occur when executing the I instructions simultaneously transferred to and stored in the instruction cache.</p><p>Still another aspect of the present invention provides a method of estimating the power consumption of a microprocessor on a target instruction the microprocessor reads out of a main memory or an instruction cache and executes through pipelined processing stages. The method includes a step of executing, at least twice, the target instruction, a step of finding the power consumption of the microprocessor in one cycle in a given range of cycles in each of the first and second executions of the target instruction, a step of accumulating the power consumption in one cycle for a given number of cycles in the given range of cycles in the first execution of the target instruction, to find out the power consumption of the microprocessor for the given number of cycles, and a step of using the power consumption for the given number of cycles in the first execution of the target instruction and the power consumption in one cycle in the second execution of the target instruction, to estimate the cache-hit power consumption of the microprocessor of reading the target instruction out of the instruction cache and executing the same, as well as the cache-missed power consumption of the microprocessor of reading the target instruction out of the main memory and executing the same. The instruction is executed in transistor- or gate-level simulations.</p><p>Still another aspect of the present invention provides a system for estimating the power consumption of a microprocessor on each instruction the microprocessor reads out of a main memory or an instruction cache and executes. The system has a unit for entering a string of machine language instructions that include consecutive target instructions and a jump instruction to jump to the first one of the target instructions, the number of the target instructions being at least twice as large as the number of instructions simultaneously read out of the main memory, a unit fo