nals PA 3:31!.</p><p>The I2MQ 212 is 44 bits wide and two cache lines deep. If a Pentium P54C processor is used, the I2MQ 212 is eight entries deep. If the Pentium P24 or 486 processors are used, then the I2MQ 212 is four entries deep. Each entry in the I2MQ 212 stores an address. Bits 35-42 of the address indicate which memory bank is being addressed. Bit 34 indicates if the entry must be snooped. Bit 33 indicates if a cycle is locked. Bits 25-32 indicate which byte enables are asserted for a write transaction. Finally, bits 0-24 correspond to PCI write address signals PCIAD 3:27!.</p><p>The CPU-PCI bridge 106 also includes power management logic. The power management scheme used in the computer system of the preferred embodiment consists of four modes with varying degrees of power consumption. The CPU-PCI bridge 106 contains portions of the control logic necessary to transition between these modes. The four modes, in order from highest to lowest power consumption, are the RUN, SLEEP, IDLE and STANDBY modes. The RUN mode is the state of normal operation. The CPU-PCI bridge 106 remains in the RUN mode until it receives a request from the MISC 118 to enter the SLEEP mode. The MISC 118 makes such a request by asserting a signal SLEEP<sub>--</sub>  to the CPU-PCI bridge 106.</p><p>The MISC 118 asserts the signal SLEEP<sub>--</sub>  in response to its internal stop clock register being set to a predetermined value in response to certain conditions. First, the operating system detects for system idleness when all software applications and device drivers are inactive. If so, the operating system notifies the BIOS of the system idle condition. The BIOS then performs a write to the stop clock register, which then causes the MISC 118 to assert the signal SLEEP<sub>--</sub>.</p><p>In addition, the MISC 118 asserts the SLEEP<sub>--</sub>  signal in response to when no interrupt activity has occurred for a programmed period of time. When a timer in the MISC 118 times out, the MISC 118 generates a system management interrupt (SMI). In response, a SMI handler is invoked to shut down the hard drive 122 and floppy drive 130, and also to write to the stop clock register in the MISC 118, which causes the MISC 118 to assert the signal SLEEP<sub>--</sub>.</p><p>When the CPU-PCI bridge 106 detects that the signal SLEEP<sub>--</sub>  has been asserted by the MISC 118, the PCON 200 responds by asserting a signal STPCLK<sub>--</sub>  to the CPU 100. This is a request to the CPU 100 to enter the STOP GRANT state. In response to assertion of the signal STPCLK<sub>--</sub>, the CPU 100 generates a STOP GRANT cycle on the CPU bus 102 to indicate that the CPU 100 is entering the STOP GRANT state, in which the internal clock of the CPU 100 is disabled to conserve power. In the STOP GRANT state, the CPU 100 is still able to respond to snoop cycles as well as interprocessor interrupts in the case of the Pentium P54 processor.</p><p>The CPU-PCI bridge 106 remains in the SLEEP mode until one of the following two conditions occur. First, if the signal SLEEP<sub>--</sub>  is deasserted, the CPU-PCI bridge 106 returns to the RUN mode and removes STPCLK<sub>--</sub>. Alternatively, according to one aspect of the present invention, if the signal SLEEP<sub>--</sub>  is asserted while the CPU-PCI bridge 106 is parked on the PCI bus 112 (i.e., the PCI grant signal CPUGNT<sub>--</sub>  to the CPU-PCI bridge 106 is asserted while the PCI request signal CPUREQ<sub>--</sub>  driven by the ICON 204 is deasserted), if all posted memory writes have completed (i.e., all queues are emptied), and if any pending refresh requests have been serviced, when the above conditions are detected, the CPU-PCI bridge 106 begins the transition from SLEEP mode to IDLE mode. The CPU-PCI bridge 106 forces one refresh cycle to complete to guarantee adequate refreshing and to put the memory controller into an idle state. Following the refresh cycle the CPU-PCI bridge 106. determines if the above conditions are still true; if so, the CPU-PCI bridge 106 transitions from SLEEP mode to the IDLE mode.</p><p>In the IDLE mode, the internal clocks of the CPU 100, the CPU-PCI bridge 106, the data buffers 108, and the L2 cache 104 are disabled. A signal IDLEACK is provided by the CPU-PCI bridge 106 to the MISC 118 to indicate that IDLE mode has been reached. The signal IDLEACK is also provided to the L2 cache 104 and the data buffers 108 to disable their internal clocks. When the signal IDLFACK is asserted, the CPU-PCI bridge 106 acts as a PCI master and drives the PCI bus 112. While the signal IDLEACK is asserted, the MISC 118 does not grant the PCI bus 112 to any other PCI bus master. Further, while the signal IDLEACK is asserted by the CPU-PCI bridge 106, if the MISC 118 deasserts the signal CPUGNT<sub>--</sub>  to unpark the CPU-PCI bridge 106, or if the MISC 118 deasserts the signal SLEEP<sub>--</sub>, the signal IDLEACK will be deasserted by the CPU-PCI bridge 106. Once the signal IDLEACK is deasserted, the MISC 118 can grant the PCI bus 112 to other PCI masters after at least one PCI clock period.</p><p>To reduce current to other components on the system board during the IDLE mode, the CPU-PCI bridge 106 drives the memory address signals MA 11:0! to all 0s, drives the PCI address/data bus PCIAD 31:0! to all 0s, drives the PCI command/byte enable signals PCIBE 3:0!<sub>--</sub>  to all 0s, drives the signals PCIDCD 3:0! to all 1s, drives the signal CPUDCD 1! high for Pentium processors and low for 486 processors, and drives the signal CPUDCD 0! high for 33 MHz operation and low for 50, 60 and 66 MHz operation. The PCIDCD 3:0! signals are driven to these states because that reflects the pullup or pulldown condition for each line for each alternative, which condition is used during reset for configuration purposes. Driving to the pullup or pulldown condition minimizes the power lost in the pullup or pulldown resistors. The signals MEMDCD 1:0! remain in their idle states of all 0s. The signals PCIDCD 3:0! are driven to the hexadecimal value of 0×F to reflect a pullup condition used to configure the CPU-PCI bridge 106.</p><p>As discussed above, the video graphics controller 114 is a 5-volt part while the other components connected to the PCI bus 112 are 3.3-volt parts. As a result, the 3.3-volt parts drive PCI signals to a high value of about 3.3 volts. If an input signal to the 5-volt video graphics controller 114 is driven to 3.3 volts, the input buffer circuitry of the video graphics controller 114 will recognize the input as a high input, but leakage current will flow in the input buffer transistors because of the incomplete high input voltage. In IDLE mode, where minimal power consumption is desired, the power management circuit according to another aspect of the present invention in the CPU-PCI bridge 106 drives the PCI address/data signals PCIAD 31:0! and byte enable signals PCIBE 3:0! to all 0s to avoid as much as possible leakage current in the input buffer circuitry of the video graphics controller 114.</p><p>Referring to FIG. 8, a schematic diagram is shown of circuitry used to drive PCI bus signals PCIAD 31:0!and PCIBE 3:0!<sub>--</sub>. A simplified representation of an input buffer 800 in the 5-volt video graphics controller 114 is shown. The input buffer 800 includes a P-channel MOSFET 802 and an N-channel MOSFET 804 arranged as an inverter. The drain of the P-channel MOSFET 802 is connected to the 5-volt power supply voltage and the source of the N-channel MOSFET 804 is connected to ground. The gates of the MOSFETs 802 and 804 are connected to a PCI bus signal, and the common node is provided to the core logic of the video graphics controller 114. If the input bus signal is driven to 3.3 volts, the N-channel MOSFET 804 is turned on but the P-channel MOSFET 802 is not completely turned off because the drain-to-gate voltage is greater than the threshold voltage of the P-channel MOSFET 802. The P-channel MOSFET 802 does not get pinched off, which results in leakage current flow between the 5-volt supply and ground.</p><p>To prevent the leakage current, the PCI address/data signals PCIAD 31:0! and byte enable signals PCIBE 3:0!<sub>--</sub>  are driven low by the CPU-PCI bridge 106. The CPU-PCI bridge 106 drives signals PCIAD 31:0! via a tristate buffer 806, whose input is connected to the output of a 64:32 multiplexor 810. The tristate buffer 806 is enabled by the output of a NAND gate 812. The inputs of the NAND gate 812 receive a master logic output enable signal MASADDOE<sub>--</sub>, a target logic output enable signal TARADDOE<sub>--</sub>, and the signal |IDLEACK. The signal MASADDOE<sub>--</sub>  is provided by the PCI master logic in the ICON 204, and the signal TARADDOE<sub>--</sub>  is provided by the PCI slave logic in the ICON 204. The 0 input of the multiplexor 810 receives the normal PCI address from internal circuitry in the CPU-PCI bridge 106, while the 1 input is tied to 0s. The select input of the multiplexor 810 receives the signal IDLEACK. Thus, in IDLE or STANDBY mode, the signals PCIAD 31:0! are all driven low.</p><p>The signals PCIBE 3:0! are driven by a tristate buffer 808, whose input is connected to the output of an 8:4 multiplexor 814. The select input of the multiplexor 814 receives the signal IDLEACK, its 0 input receives the multiplexed command or byte enable signals in the CPU-PCI bridge 106, and the 1 input of the multiplexor 814 is tied to 0s. The enable input of the tristate buffer receives a byte enable output enable signal |BEOE<sub>--</sub>, which is asserted when the CPU-PCI bridge 106 is parked on the PCI bus 112. A signal name preceded by the character \"|\" indicates that the signal is inverted. Thus, in IDLE or STANDBY mode, the PCI bus signals PCIBE 3:0! are also driven low.</p><p>By driving the address/data and byte enable signals to all 0s, the amount of leakage current flowing through the input buffer circuitry of the video graphics controller 114 is significantly reduced. In this condition, the N-channel MOSFET 804 is off and the P-channel MOSFET 802 is also off because the drain-to-source voltage of the P-channel MOSFET 802 is about zero volts in steady state. A similar solution can be applied in a system where there exists a mixture of 3.3-volt and 2.5-volt components.</p><p>During IDLE mode, the clock to the core logic of the CPU-PCI bridge 106 is shut off. Consequently, the MCON 202 is unable to perform normal refresh cycles to the DRAMs 110. However, according to yet another aspect of the present invention, the CPU-PCI bridge 106 receives an asynchronous clock RFSHCLK from the MSIO chip 124, which is used to run the real time clock (RTC). The signal RFSHCLK preferably has a frequency of about 32 kHz with approximately a 50--50 duty cycle.</p><p>Based on the asynchronous refresh clock RFSHCLK