chronous type memory is not shown as a function block in the microprocessor, but in the microprocessor incorporating a large capacity memory on the chip, the greater part of the power thereof is consumed by the memory. Then, it is considered that this invention of the Japanese Patent Application Laid-Open No. 63-26716(1988) is applied to the microprocessor incorporating the synchronous type memory as a function block, but in this case, clock supply to the whole of the memory is stopped. However, as shown in FIG. 2, the memory is normally divided into the portions of the address decoder, the word line driving circuit, the bit line pre-charging circuit, the sense amplifier and the like. For this reason, where clock supply is stopped uniformly for the whole memory as described above, supply and stop of clock in response to the status of each portion of the memory cannot be carried out, and therefore various troubles might take place.</p><p>For example, in a circuit construction in which addresses are decoded during durations of \"H\" of the clock and the word lines are driven during durations of \"L\" of the clock, the word lines are desirably made non-active, in other words, the clock supply is desirably stopped at its state of \"H\" in order to protect the stored contents of the memory. However, when the clock supply is stopped to do so, the decoder is put intact in the operated state, and there is possibility of power consumption.</p><h4>SUMMARY OF THE INVENTION</h4><p>The present invention has been achieved in the light of such circumstances, and purposes to provide a microprocessor which curtails power consumption by eliminating wasteful power consumption as described above, and can supply and stop clock in response to the status of each portion of a built-in synchronous type memory.</p><p>A microprocessor of the present invention is constituted in a manner that an enable signal is made non-active when a built-in synchronous type memory is not required to be accessed, and by giving this signal to the whole or part of the memory, supply of a synchronous signal (clock) to that portion is stopped. Thereby, when an instruction to be executed does not necessitate an access to the memory, the whole or part of the memory is not operated, and therefore no power is consumed, and the respective portions are put in the stopped state in an optimum state, and therefore the contents of the memory earl be protected.</p><p>The above and further objects and features of the invention will more fully be apparent from the following detailed description with accompanying drawings.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a timing chart showing a state of operation of a conventional microprocessor,</p><p>FIG. 2 is a block diagram showing a configuration example of the same,</p><p>FIG. 3 is a block diagram showing a configuration example of a microprocessor of the present invention,</p><p>FIG. 4 is a circuit diagram showing a configuration of an address decoder of the same,</p><p>FIG. 5 is a circuit diagram showing a configuration of a pre-charging circuit of tile same,</p><p>FIG. 6 is a circuit diagram showing a circuit configuration of one bit of a memory cell array, that is, a circuit configuration of a memory cell and one bit of a sense amplifier corresponding thereto,</p><p>FIG. 7 is a timing chart showing a state of operation of the microprocessor of the present invention, and</p><p>FIG. 8 is a circuit diagram showing another configuration example of the address decoder.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><p>Hereinafter, detailed description is made on the present invention based on drawings showing embodiments thereof.</p><p>FIG. 3 is a block diagram showing a configuration example of a microprocessor of the present invention incorporating a synchronous type memory.</p><p>In FIG. 3, numeral 9 designates a one-chip microprocessor, which is constituted by incorporating a CPU 10, a synchronous type memory 3 and the like.</p><p>The CPU 10 is constituted with an instruction register 1, an instruction decoder 2, an ALU (Arithmetic and Logic Unit) which is not illustrated and the like.</p><p>The instruction register 1 holds an instruction to be executed. Also, the instruction decoder 2 decodes the instruction held in the instruction register 1.</p><p>The synchronous type memory 3 is constituted with an address decoder 31, a sense amplifier 32, a pre-charging circuit 33, a memory cell array 34 and the like, and stores various data in the memory cell array 34.</p><p>Numeral 4 designates address signal lines, which input an address signal representing the memory location of data to be accessed by the CPU 10 in the synchronous type memory 3 to the address decoder 31.</p><p>The address decoder 31 decodes the address signal inputted through address signal lines 4, and outputs the decoded result to the memory cell array 34 through word lines 35. In addition, the circuit configuration of the address decoder 31 is described later.</p><p>Numeral 5 designates output data signal lines. A signal of data read from the memory cell array 34 is amplified by the sense amplifier 32, being outputted to the output data signal lines 5.</p><p>Numeral 6 designates four-phase clock lines, which transmits a four-phase clock to the above-described address decoder 31, the pre-charging circuit 33 and the sense amplifier 32 as described later and the like.</p><p>The pre-charging circuit 33 pre-charges bit lines 36 of the memory cell array 34. In addition, the circuit configuration of the pre-charging circuit 33 is described later.</p><p>Then, an enable signal EN is outputted from the instruction decoder 2 to the address decoder 31 and the precharging circuit 33 through an enable signal line 7, respectively. At decoding an instruction, in the case where the instruction is executed, the instruction decoder 2 judges whether or not an access to the synchronous type memory 3 is required, and when it is required, the instruction decoder 2 makes the enable signal EN outputted to the enable signal line 7 be active (\"H\" in this embodiment), and when not required, the instruction decoder 2 makes the enable signal EN be non-active (\"L\" in this embodiment).</p><p>FIG. 4 is a circuit diagram showing a circuit configuration of the address decoder 31.</p><p>Numeral 61 designates a clock line transmitting a clock T1 among the four-phase clock lines 6, which is connected to one input of each of two-input AND gates 315 and 316. The enable signal line 7 is connected to the other input of each of the AND gates 315 and 316. In addition, the clock line 61 is connected to the AND gate 316 through an inverter 317.</p><p>An output of the AND gate 315 is given to an address latch 311.</p><p>The address latch 311 latches an address signal inputted through the address signal lines 4. Specifically, a gate transistor 3110 and a ratio latch 3111 are connected in series in this sequence from the input side in correspondence to each bit of the address signal lines 4. Then, a circuit is so constituted that open/close control of each gate transistor 3110 is performed by an output signal of the AND gate 315.</p><p>Accordingly, only during a duration when the enable signal EN being one input of the AND gate 315 is high level (\"H\") and the clock T1 being the other input of the AND gate 315 given through the clock line 61 is high level (\"H\"), the output signal of the AND gate 315 also turns to high level (\"H\"), and each gate transistor 3110 of the address latch 311 is opened, and therefore the address signal is latched in each ratio latch 3111 of each bit of the address signal lines 4 during this time.</p><p>In other words, the AND gate 315 functions as a means for stopping the supply of clock to the address latch 311.</p><p>The address signal latched in each ratio latch 3111 of the address latch 311 is given to a decode part 312.</p><p>The decode part 312 outputs a word line select signal respectively from each NAND gate 2120 to a word line driving circuit 313 by properly performing logical operation of an output of each ratio latch 3111 of the address latch 311 by a NAND gate 3120.</p><p>The word line driving circuit 313 is a circuit which drives each word line 35 according to the word line select signal outputted from the decode part 312, and an access gate 3130 which is open/close-controlled by an output signal of the AND gate 316 is inserted into each word line 35.</p><p>Accordingly, only during a duration when the enable signal EN being one input of the AND gate 316 is high level (\"H\") and a clock T1 of the clock line 61 being the other input given while inverted through the inverter 317 is high level (\"H\") (clock T1 is low level (\"L\"), the output signal of the AND gate 316 turns to high level (\"H\"), and each access gate 3130 of the word line driving circuit 313 is opened, and the word line 35 is driven.</p><p>In other words, the AND gate 316 functions as a means for stopping the supply of clock to the word line driving circuit 313.</p><p>FIG. 5 is a circuit diagram showing a configuration of the pre-charging circuit 33 of bit lines.</p><p>The pre-charging circuit 33 is constituted with a two-input NAND gate 330 to inputs of which the enable signal line 7 and the clock line 61 are connected, and a low-active gate 331 of each bit line which is open/close-controlled by the output signal of the NAND gate 330. One end of each gate 331 is connected to the power source potential, and the other end is connected to each bit line 36.</p><p>Accordingly, only during a duration when the enable signal EN given through the enable signal line 7 is high level (\"H\") and the clock T11 given through the clock line 61 is high level (\"H\"), the output signal of the NAND gate 330 turns to low level (\"L\"), and each gate 331 is opened, and each bit line 36 is pre-charged.</p><p>FIG. 6 is a circuit diagram showing a circuit configuration for one bit of the memory cell array 34, that is, a circuit configuration of a memory cell 340 and one bit 320 of the sense amplifier 32 corresponding thereto.</p><p>Each memory cell 340 is located at a point of intersection point of a pair of bit lines 36' of the bit lines 36 pre-charged by the above-described pre-charging circuit 33 and the word line 35 connected to the address decoder 31. When the pair of bit lines 36' and the word line 35 are selected, the memory cell 340 located at the intersection point of the both is selected, and the signal (high level or low level) stored 