“Ready” is asserted and the process <b>600</b> returns to normal operation until a “Return” is asserted at decision step <b>620</b>. If a “Retransmit” is asserted before a “Return” is requested, the return address is replaced so that the return address marks the location of the read pointer when the last “Retransmit” was requested in accordance with the mode definitions.</p><p>It should be noted that while the various operations described and illustrated with respect to FIG. 11 have been shown as substantially sequential for purposes of clarity, many of the operations may and would desirably be effectuated in parallel for sake of overall speed of operation.</p><p>An exemplary utilization of the “Retransmit” feature of the memory device <b>500</b> might be one in which a network bridge receives data in one protocol and packet changes the protocol, re-packetizes the data and transmits. Many times protocols include cyclical redundancy checks (“CRCs”) and if there is a transmission error, a request is sent back to the controller to re-send the packet. If a FIFO memory device <b>500</b> having the architecture previously disclosed were employed, and the packet was still in the FIFO memory device <b>500</b>, a re-send request could be handled without going through the bridge back to the other network, changing the protocol, re-packetizing the data and stacking it back in the FIFO memory device <b>500</b>. The controller could then simply finish sending the current packet (e.g. Mode <b>0</b>) back up the required number of packets, begin to resend the packet that was in error and assert “Return”. The FIFO memory device <b>500</b> will complete the transmission of the packet that was received in error and return to the packet that was next in line when the “Retransmit” request was received and is then ready to transmit where it left off.</p><p>While there have been described above the principles of the present invention in conjunction with specific device architecture, it is to be clearly understood that the foregoing description is made only by way of example and not as a limitation to the scope of the invention. While the exemplary memory device disclosed represents an asynchronous device, in a synchronous implementation the read and write clocks may be replaced with read and write enables instead. Particularly, it is recognized that the teachings of the foregoing disclosure will suggest other modifications to those persons skilled in the relevant art. Such modifications may involve other features which are already known per se and which may be used instead of or in addition to features already described herein. Although claims have been formulated in t