ription of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DETAILED DESCRIPTION</h4><p>One embodiment of the present invention is a memory controller that includes two memory address buses. The memory controller has a reduced number of power and ground pins because only one of the memory address buses is toggled at a time.</p><p>FIG. 2 is a block diagram of a memory controller coupled to memory slots in a computer in accordance to one embodiment of the present invention. The memory controller <b>50</b> includes two memory address buses: memory address bus <b>51</b> and memory address bus <b>52</b>. Each memory address bus is coupled to different memory slots <b>10</b>-<b>13</b>. Specifically, memory address bus <b>51</b> is coupled to memory slot <b>10</b> via line <b>54</b> and memory slot <b>11</b> via line <b>56</b>. Similarly, memory address bus <b>52</b> is coupled to memory slot <b>12</b> via line <b>58</b> and memory slot <b>13</b> via line <b>60</b>. Memory modules (e.g., SIMMS, DIMMS populated with SRAM or DRAM), not shown in FIG. 2, can be inserted in slots <b>10</b>-<b>13</b>.</p><p>Memory controller <b>50</b> is also coupled to other devices and buses in the computer that require access to memory slots <b>10</b>-<b>13</b>. For example, a processor <b>53</b> and a system bus <b>55</b> are typically coupled to memory controller <b>50</b>.</p><p>Memory controller <b>50</b> has a reduced number of power and ground pins as compared to prior art memory controllers with an equal number of memory address buses. Specifically, memory controller <b>50</b> does not require one power and one ground pin for every four pins of memory address buses <b>51</b> and <b>52</b> because memory controller <b>50</b> toggles the pins of only one of the memory address buses <b>51</b>, <b>52</b> at a time. This allows memory address buses <b>51</b>, <b>52</b> to share each power and ground pin, and the ratio of memory address bus pins to power and ground pins is increased to approximately 8:1. Therefore, the memory address bus pins in memory controller <b>50</b> require approximately one-half of the power and ground pins required by the prior art memory address bus pins.</p><p>FIG. 3 is an overview of the circuitry within memory controller <b>50</b> for toggling one memory address bus <b>51</b>, <b>52</b> at a time. FIG. 3 illustrates two pins <b>71</b>, <b>72</b> of memory address bus <b>51</b> and two pins <b>81</b>, <b>82</b> of memory address bus <b>52</b>. Other pins of buses <b>51</b>, <b>52</b> not shown in FIG. 3 are coupled to identical circuitry as pins <b>71</b>, <b>72</b>, <b>81</b>, <b>82</b>. In one embodiment, memory address buses <b>51</b> and <b>52</b> are thirteen bits wide and therefore each include thirteen pins.</p><p>A request bus <b>90</b> transmits memory requests to the circuitry of FIG. 3 within memory controller <b>50</b>. Memory requests are requests to access memory and are generated by devices internal and external to memory controller <b>50</b>. Each memory request typically includes a memory address, the type of memory access (i.e., read or write) and the size of the memory access.</p><p>In one embodiment, each memory slot <b>10</b>-<b>13</b> shown in FIG. 2 includes two logical memory rows for a total of eight logical rows. The memory rows are numbered consecutively from 0-7. Memory slot <b>10</b> includes logical memory rows <b>0</b> and <b>1</b>, memory slot <b>11</b> includes logical memory rows <b>2</b> and <b>3</b>, and so on.</p><p>Request bus <b>90</b> is coupled to a row decoder <b>64</b>. Row decoder <b>64</b> determines which of a plurality of memory rows includes the memory module requested by the memory request.</p><p>The memory row determined by decoder <b>64</b> is input to a logic block <b>66</b> via line <b>91</b>. Logic block <b>66</b> functions as a source of output enable lines <b>74</b>, <b>84</b>. Also input to logic block <b>66</b> is the output of a state machine <b>68</b> via line <b>92</b>. State machine <b>68</b> receives a plurality of inputs <b>98</b>, <b>99</b> from for example, requesting sources and internal status registers. State machine <b>68</b> determines when a particular memory row can be loaded based on various operating conditions required by the memory devices in the memory row (e.g., memory refresh status, loading conditions, etc.).</p><p>Each pin <b>71</b>, <b>72</b>, <b>81</b>, <b>82</b> is cou