rder to achieve the above object, according to a first aspect of the present invention, there is provided a power consumption estimating system for estimating power consumption in a processor when instructions contained in an execution program are executed, comprising means for tracing a source program of the execution program; means for receiving trace information and detecting whether or not the processor is put into a stall when the instructions are executed; and means for receiving trace information to which stall information is added and estimating power consumption when the instructions are executed; wherein the detecting means detects the stall information by looking up operation information of the processor, and the estimating means estimates the power consumption in the processor by looking up a library in which power consumption for each instruction is collected with regard to the stall information.</p><p>In the first aspect of the present invention, the power consumption for each instruction is calculated previously with regard to the stall information and stored as a library, and then the power consumption for each instruction can be detected by referring to the library based on the trace information to which the stall information are added. The power consumption of the processor can be estimated precisely and quickly by summing up the power consumption for each instruction when the instructions contained in the execution program are executed. Then, this estimated result can be fed back quickly to the programmer who programs the source program. Since the power consumption can be estimated from the source program prior to compile, it is possible for the programmer to execute the programming with regard to the estimated result. As a result, the lower power consumption of the processor can be achieved.</p><p>According to a second aspect of the present invention, there is provided a power consumption estimating system for estimating power consumption in a processor when instructions contained in an execution program are executed, comprising means for statically expanding a source program of the execution program; and means for receiving the source program which has been expanded statically and estimating power consumption when the instructions are executed; wherein the statically expanding means has information necessary for expansion of the source program and expands the source program based on expansion information, and the estimating means estimates the power consumption in the processor with reference to a library in which the power consumption for each instruction is collected with regard to information indicating whether or not the processor is put into a stall when the instructions are executed.</p><p>In the second aspect of the present invention, information necessary for the expansion of the source program can be provided previously to the statically expanding means. Accordingly, it is feasible to expand the source program without the actual simulation. In addition, the power consumption for the unfinished source program can be estimated.</p><p>According to a third aspect of the present invention, there is provided a power consumption estimating method of estimating power consumption in a processor when instructions contained in an execution program are executed, comprising the steps of receiving a source program of the execution program; tracing the source program; receiving trace information and detecting whether or not the processor is put into a stall when the instructions are executed; receiving trace information to which stall information is added and estimating power consumption when the instructions are executed; and outputting an estimated result of the power consumption; wherein the stall information are detected by looking up operation information of the processor in the detecting step, and the power consumption in the processor is estimated by looking up a library in which power consumption for each instruction is collected with regard to the stall information in the estimating step.</p><p>According to a fourth aspect of the present invention, there is provided a storage medium for storing a power consumption estimating program which estimates power consumption in a processor when instructions contained in an execution program are executed, the program comprising the steps of receiving a source program of the execution program; tracing the source program; receiving trace information and detecting whether or not the processor is put into a stall when the instructions are executed; receiving trace information to which stall information is added and estimating power consumption when the instructions are executed; and outputting an estimated result of the power consumption; wherein the stall information are detected by looking up operation information of the processor in the detecting step, and the power consumption in the processor is estimated by looking up a library in which power consumption for each instruction is collected with regard to the stall information in the estimating step.</p><p>Other and further objects and features of the present invention will become obvious upon an understanding of the illustrative embodiments about to be described in connection with the accompanying drawings or will be indicated in the appended claims, and various advantages not referred to herein will occur to one skilled in the art upon employing of the invention in practice.</p><?BRFSUM description=\"Brief Summary\" end=\"tail\"?><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?><h4>BRIEF DESCRIPTION OF THE DRAWINGS</h4><p>FIG. 1 is a block diagram showing a configuration of a simulation system which estimates power consumption in a processor;</p><p>FIG. 2 is a block diagram showing a configuration of a processor power consumption estimating system according to a first embodiment of the present invention;</p><p>FIG. 3 is a block diagram showing a configuration of a processor whose power consumption is estimated in the first embodiment of the present invention;</p><p>FIG. 4 is a view illustrating options of a compiler employed in the first embodiment of the present invention;</p><p>FIG. 5 is a view illustrating a correspondence between a source code and assembly codes if different compilers are employed;</p><p>FIG. 6 is a view showing an example in which the execution order of instructions of the source code is changed if different compilers are employed;</p><p>FIG. 7 is a view showing an instruction sequence of a source program employed in the first embodiment of the present invention;</p><p>FIG. 8 is a view showing trace information for the source program in FIG. 7;</p><p>FIG. 9 is a view showing the trace information in FIG. 8 to which stall information are added;</p><p>FIG. 10 is a block diagram showing a configuration of a processor power consumption estimating system which is employed when a power consumption library for one equation/one function employed in the first embodiment of the present invention is constructed;</p><p>FIG. 11 is a view showing an example of the power consumption library for one equation/one function employed in the first embodiment of the present invention;</p><p>FIG. 12 is a view showing the power consumption library for one equation/one function with respect to equations and functions contained in the source program sequence in FIG. 7, which is calculated by the processor power consumption estimating system in FIG. 10;</p><p>FIG. 13 is a view showing estimated results of the processor power consumption derived from the source program sequence in FIG. 7 by using the power consumption library for one equation/one function in FIG. 12;</p><p>FIGS. 14A, <b>14</b>B and <b>14</b>C are flowcharts showing process procedures in a stall information detecting algorithm employed in the first embodiment of the present invention;</p><p>FIG. 15 is a view showing a maximum/minimum power consumption library for one equation/one function with respect to the equations and the functions contained in the source program sequence in FIG. 7, which is calculated by the processor power consumption estimating system in FIG. 10;</p><p>FIG. 16 is a view showing estimated results of the processor power consumption derived from the source program sequence in FIG. 7 by using the maximum/minimum power consumption library for one equation/one function in FIG. 15;</p><p>FIG. 17 is a block diagram showing a configuration of a processor power consumption estimating system according to a second embodiment of the present invention;</p><p>FIG. 18 is a block diagram showing a configuration of a data cache information detecting system provided in a processor power consumption estimating system according to a third embodiment of the present invention;</p><p>FIG. 19 is a view showing instruction sequence of the source program employed in a data cache information detecting system according to the third embodiment of the present invention;</p><p>FIG. 20 is a view showing instruction execution order in FIG. 19;</p><p>FIG. 21 is a flowchart showing process procedures in a data cache information detecting algorithm employed in the third embodiment of the present invention;</p><p>FIG. 22 is a view showing change in internal states of the data cache when the instruction sequence in FIG. 19 is executed in the execution order in FIG. 20;</p><p>FIG. 23 is a view showing another instruction execution order in FIG. 19;</p><p>FIG. 24 is a view showing change in internal states of the data cache when the instruction sequence in FIG. 19 is executed in the execution order in FIG. 23;</p><p>FIG. 25 is a view showing a first example of an estimated result of the power consumption displayed by using GUI;</p><p>FIG. 26 is a view showing a second example of the estimated result of the power consumption displayed by using GUI;</p><p>FIG. 27 is a view showing a third example of the estimated result of the power consumption displayed by using GUI;</p><p>FIG. 28 is a view showing a fourth example of the estimated result of the power consumption displayed by using GUI;</p><p>FIG. 29 is a view showing a first example of data cache miss information displayed by using GUI; and</p><p>FIG. 30 is a view showing a second example of the data cache miss information displayed by using GUI.</p><?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?><?DETDESC description=\"Detailed Description\" end=\"lead\"?><h4>DESCRIPTION OF THE PREFERRED EMBODIMENTS</h4><p>Various embodiments of the present invention will be described with reference to the accompanying drawings. It is to be noted that the same or similar reference numerals are applied to the same or similar parts and elements throughout the drawings, and the description of the same or similar parts and elements will be omitted or simplified.</p><h4>(First Embodiment)</h4><p>FIG. 2 is a block diagram showing a configuration of a processor power consumption estimating system according to a first embodiment of the present invention. The processor power consumption estimating system according to the first embodiment of the present invention comprises a tracer <b>8</b>B for receiving a source program sequence <b>1</b> at a function level and generating trace information <b>9</b>B of the source program sequence <b>1</b>, a stall information detector <b>10</b>B for receiving the trace information <b>9</b>B and detecting stall information <b>12</b>B of the execution program by using operation information <b>11</b> of the microprocessor, and an estimation portion <b>13</b>B for estimating the power consumption <b>7</b>B in instruction execution by using the trace info